webmultimedia/doc/lernjournal_guenthard_patrick.tex
% Created 2016-10-04 Di. 17:06
\documentclass[11pt]{article}
\usepackage[latin1]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Patrick Günthard}
\date{5ia13c Berufbildungsschule Winterthur}
\title{Lernjournal}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

\section{\textit{<2016-09-06>}}
\label{sec-1}

\subsection{Gemacht}
\label{sec-1-1}

Wir haben angefangen, die verschiedenen Komponenten welche wir verwenden wollen, herunterzuladen und 
das Projekt aufzusetzten.


\section{\textit{<2016-09-13>}}
\label{sec-2}
\subsection{Gemacht}
\label{sec-2-1}

Ich habe an der Web-Applikation weitergearbeitet. Ich arbeite schon seit einigen Tagen daran gearbeitet.
Heute habe ich die Login- und Signup funktion fertig implementiert und getestet. Ich habe auch begonnen, 
eine logout funktion zu implementieren.


\subsection{Was habe ich gelernt?}
\label{sec-2-2}

Ich habe nichts neues hinzugelernt, da ich alle dinge welche ich implementiert habe, schon einmal
gemacht habe.

\section{\textit{<2016-09-20>}}
\label{sec-3}
\subsection{Gemacht}
\label{sec-3-1}

Heute habe ich am Backend gearbeitet. Ich habe weiter Rest-Services implementiert.

\section{\textit{<2016-09-27>}}
\label{sec-4}

\subsection{Gemacht}
\label{sec-4-1}

Heute habe ich am Frontend weitergearbeitet. Ich habe auch recherchiert, wie man mit \textbf{node js} einen file-upload zum laufen bringen kann.

\subsection{Was Ich heute gelernt habe}
\label{sec-4-2}

Ich habe mich mit File Upload mit node js beschäftigt und gelernt, wie dieser funktioniert.

\section{\textit{<2016-10-04>}}
\label{sec-5}


\subsection{Gemacht}
\label{sec-5-1}

Ich habe weiter an der Upload Funktion gearbeitet. Ich habe sowohl am Frontend und am 
Backend versucht, die nötigen methoden zu implementieren. Ich habe es jedoch nicht fertig
geschafft.

\subsection{Was Ich heute gelernt habe}
\label{sec-5-2}

Ich habe heute mehr über HTML-Forms und Ajax in AngularJS gelernt.
% Emacs 24.5.1 (Org mode 8.2.10)
\end{document}
